Revit 2024 API
NonContinuousRailStructure.GetNonContinuousRailCount Method
 Gets number of Non-Continuous Rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public int GetNonContinuousRailCount()
Visual Basic
Public Function GetNonContinuousRailCount As Integer
Visual C++
public:
int GetNonContinuousRailCount()
Return Value
 Count of Non-Continuous Rails.
See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace